{
  "Taj Mahal": "The Taj Mahal is a UNESCO World Heritage site in Agra, India, built by Shah Jahan in memory of his wife Mumtaz Mahal. Famous for its white marble architecture.",
  "Qutub Minar": "Qutub Minar in Delhi is the tallest brick minaret in the world, built in 1193. Known for Indo-Islamic architecture.",
  "Red Fort": "Red Fort in Delhi is a historic fort built in 1639 by Mughal emperor Shah Jahan. Famous for its massive walls and Mughal architecture.",
  "India Gate": "India Gate in Delhi is a war memorial built in 1931, dedicated to soldiers who died in World War I. Popular tourist attraction in the capital city.",
  "Hawa Mahal": "Hawa Mahal in Jaipur, Rajasthan, is a pink sandstone palace built in 1799. Famous for its unique honeycomb structure and small windows called jharokhas.",
  "Gateway of India": "Gateway of India in Mumbai was built in 1924 to commemorate the visit of King George V. A famous tourist spot and iconic monument.",
  "Charminar": "Charminar in Hyderabad, Telangana, built in 1591, is a historic mosque and landmark. Known for its four grand arches and vibrant surrounding markets.",
  "Mysore Palace": "Mysore Palace in Karnataka is a royal residence of the Wadiyar dynasty. Famous for its grand architecture, intricate interiors, and Dasara festival celebrations.",
  "Amer Fort": "Amer Fort in Jaipur, Rajasthan, is a 16th-century fort known for its artistic Hindu style elements, large ramparts, and scenic views.",
  "Konark Sun Temple": "Konark Sun Temple in Odisha, built in the 13th century, is a UNESCO World Heritage site. Famous for its chariot-shaped architecture and intricate carvings.",
  "Sanchi Stupa": "Sanchi Stupa in Madhya Pradesh is one of the oldest stone structures in India, built by Emperor Ashoka. Famous for Buddhist architecture and carvings.",
  "Victoria Memorial": "Victoria Memorial in Kolkata, West Bengal, built in 1921, is dedicated to Queen Victoria. A popular tourist spot with beautiful gardens and museum.",
  "Meenakshi Temple": "Meenakshi Temple in Madurai, Tamil Nadu, is a historic Hindu temple dedicated to Goddess Meenakshi and Lord Sundareswarar. Famous for its colorful gopurams and intricate sculptures.",
  "Fatehpur Sikri": "Fatehpur Sikri near Agra was the capital of Mughal Emperor Akbar in the 16th century. Famous for its historic buildings like Buland Darwaza and Jama Masjid.",
  "Jaisalmer Fort": "Jaisalmer Fort in Rajasthan, also called Sonar Quila, is a historic fort built in 1156 AD. Famous for its massive walls, yellow sandstone, and bustling markets inside the fort.",
  "Ajanta Caves": "Ajanta Caves in Maharashtra are ancient Buddhist rock-cut caves built between 2nd century BCE and 480 CE. Famous for murals, paintings, and sculptures.",
  "Ellora Caves": "Ellora Caves in Maharashtra are rock-cut monuments dating from 600-1000 CE. Famous for Buddhist, Hindu, and Jain temples with intricate carvings.",
  "Golden Temple": "Golden Temple in Amritsar, Punjab, is the holiest Sikh gurdwara. Famous for its golden architecture, serene pool, and spiritual significance.",
  "Hampi": "Hampi in Karnataka is a UNESCO World Heritage site. Famous for the ruins of the Vijayanagara Empire, stone temples, and boulder-strewn landscape.",
  "Gol Gumbaz": "Gol Gumbaz in Bijapur, Karnataka, is the mausoleum of Mohammed Adil Shah. Famous for its massive dome and whispering gallery.",
  "Belur and Halebidu Temples": "Located in Karnataka, Belur and Halebidu are famous for Hoysala architecture and intricate stone carvings.",
  "Badami Caves": "Badami Cave Temples in Karnataka are rock-cut temples dating back to the 6th century. Famous for Hindu, Jain, and Buddhist carvings.",
  "Tirumala Venkateswara Temple": "Tirumala Venkateswara Temple in Tirupati, Andhra Pradesh, is one of the most visited pilgrimage sites in the world. Dedicated to Lord Venkateswara.",
  "Golconda Fort": "Golconda Fort in Hyderabad, Telangana, is a historic fort famous for its acoustics, architecture, and diamond trade history.",
  "Ramoji Film City": "Ramoji Film City near Hyderabad is one of the world’s largest film studio complexes. A popular tourist attraction with film sets and entertainment activities."
}
